import React, { useMemo } from "react"
import { Chart } from "react-charts"
import useChartConfig from "../../utils/randomizeChart"

function ChartArea(props) {
    const { data } = useChartConfig({
      series: 4
    })

//   const data = [
//     {
//       label: "Социальные сети",
//       datums: [
//         { x: "2020-03-17T20:00:00.000Z", y: 82 },
//         { x: "2020-03-17T20:30:00.000Z", y: 78 },
//         { x: "2020-03-17T21:00:00.000Z", y: 93 },
//         { x: "2020-03-17T21:30:00.000Z", y: 65 },
//         { x: "2020-03-17T22:00:00.000Z", y: 39 },
//         { x: "2020-03-17T22:30:00.000Z", y: 35 },
//         { x: "2020-03-17T23:00:00.000Z", y: 19 },
//         { x: "2020-03-17T23:30:00.000Z", y: 36 },
//         { x: "2020-03-18T00:00:00.000Z", y: 34 },
//         { x: "2020-03-18T00:30:00.000Z", y: 50 }
//       ]
//     },
//     {
//       label: "Развлечения",
//       datums: [
//         { x: "2020-03-17T20:00:00.000Z", y: 44 },
//         { x: "2020-03-17T20:30:00.000Z", y: 80 },
//         { x: "2020-03-17T21:00:00.000Z", y: 73 },
//         { x: "2020-03-17T21:30:00.000Z", y: 68 },
//         { x: "2020-03-17T22:00:00.000Z", y: 32 },
//         { x: "2020-03-17T22:30:00.000Z", y: 74 },
//         { x: "2020-03-17T23:00:00.000Z", y: 69 },
//         { x: "2020-03-17T23:30:00.000Z", y: 88 },
//         { x: "2020-03-18T00:00:00.000Z", y: 43 },
//         { x: "2020-03-18T00:30:00.000Z", y: 44 }
//       ]
//     },
//     {
//       label: "Продуктивность",
//       datums: [
//         { x: "2020-03-17T20:00:00.000Z", y: 15 },
//         { x: "2020-03-17T20:30:00.000Z", y: 63 },
//         { x: "2020-03-17T21:00:00.000Z", y: 20 },
//         { x: "2020-03-17T21:30:00.000Z", y: 16 },
//         { x: "2020-03-17T22:00:00.000Z", y: 62 },
//         { x: "2020-03-17T22:30:00.000Z", y: 53 },
//         { x: "2020-03-17T23:00:00.000Z", y: 14 },
//         { x: "2020-03-17T23:30:00.000Z", y: 46 },
//         { x: "2020-03-18T00:00:00.000Z", y: 53 },
//         { x: "2020-03-18T00:30:00.000Z", y: 73 }
//       ]
//     },
//     {
//       label: "Другое",
//       datums: [
//         { x: "2020-03-17T20:00:00.000Z", y: 36 },
//         { x: "2020-03-17T20:30:00.000Z", y: 65 },
//         { x: "2020-03-17T21:00:00.000Z", y: 21 },
//         { x: "2020-03-17T21:30:00.000Z", y: 89 },
//         { x: "2020-03-17T22:00:00.000Z", y: 9 },
//         { x: "2020-03-17T22:30:00.000Z", y: 95 },
//         { x: "2020-03-17T23:00:00.000Z", y: 35 },
//         { x: "2020-03-17T23:30:00.000Z", y: 83 },
//         { x: "2020-03-18T00:00:00.000Z", y: 74 },
//         { x: "2020-03-18T00:30:00.000Z", y: 62 }
//       ]
//     }
//   ]

  const series = React.useMemo(
    () => ({
      type: "area"
    }),
    []
  )
  const axes = React.useMemo(
    () => [
      { primary: true, position: "bottom", type: "time", show: false },
      { position: "left", type: "linear", stacked: true, show: false }
    ],
    []
  )

  let colors = ["#f0c334", "#53b872", "#ef5b5f", "#945ca3", "#3496BD"]

  const getSeriesStyle = series => ({ color: colors[series.index] })

  return (
    <div className="section__chart_area">
      <Chart
        data={data}
        series={series}
        getSeriesStyle={getSeriesStyle}
        axes={axes}
        tooltip
      />
    </div>
  )
}

export default ChartArea
